In [3]:
#Workshop-3
#3.1 Warm Up Exercises
#Problem-1
import pandas as pd
df = pd.read_csv("C:/Users/Natsu Rohit/Downloads/Titanic-Dataset.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
fare = df[["Fare"]]
print(fare.head())

      Fare
0   7.2500
1  71.2833
2   7.9250
3  53.1000
4   8.0500

In [6]:
class_age = df[["Pclass","Age"]]
print(class_age.head())

   Pclass   Age
0       3  22.0
1       1  38.0
2       3  26.0
3       1  35.0
4       3  35.0

In [7]:
survived_gender = df[["Survived","Sex"]]
print(survived_gender.head())

   Survived     Sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [20]:
#Problem-2
fare_gt_100 = df[df["Fare"]>100]
print(fare_gt_100[["PassengerId","Name","Fare"]])

     PassengerId                                               Name      Fare
27            28                     Fortune, Mr. Charles Alexander  263.0000
31            32     Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
88            89                         Fortune, Miss. Mabel Helen  263.0000
118          119                           Baxter, Mr. Quigg Edmond  247.5208
195          196                               Lurette, Miss. Elise  146.5208
215          216                            Newell, Miss. Madeleine  113.2750
258          259                                   Ward, Miss. Anna  512.3292
268          269      Graham, Mrs. William Thompson (Edith Junkins)  153.4625
269          270                             Bissette, Miss. Amelia  135.6333
297          298                       Allison, Miss. Helen Loraine  151.5500
299          300    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  247.5208
305          306                     Allison, Master. Hudson Trevor  151.5500
306          307                            Fleming, Miss. Margaret  110.8833
307          308  Penasco y Castellana, Mrs. Victor de Satode (M...  108.9000
311          312                         Ryerson, Miss. Emily Borie  262.3750
318          319                           Wick, Miss. Mary Natalie  164.8667
319          320  Spedden, Mrs. Frederic Oakley (Margaretta Corn...  134.5000
325          326                           Young, Miss. Marie Grice  135.6333
332          333                          Graham, Mr. George Edward  153.4625
334          335  Frauenthal, Mrs. Henry William (Clara Heinshei...  133.6500
337          338                    Burns, Miss. Elizabeth Margaret  134.5000
341          342                     Fortune, Miss. Alice Elizabeth  263.0000
373          374                                Ringhini, Mr. Sante  135.6333
377          378                          Widener, Mr. Harry Elkins  211.5000
380          381                              Bidois, Miss. Rosalie  227.5250
390          391                         Carter, Mr. William Ernest  120.0000
393          394                             Newell, Miss. Marjorie  113.2750
435          436                          Carter, Miss. Lucile Polk  120.0000
438          439                                  Fortune, Mr. Mark  263.0000
498          499    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  151.5500
505          506         Penasco y Castellana, Mr. Victor de Satode  108.9000
527          528                                 Farthing, Mr. John  221.7792
537          538                                LeRoy, Miss. Bertha  106.4250
544          545                         Douglas, Mr. Walter Donald  106.4250
550          551                        Thayer, Mr. John Borland Jr  110.8833
557          558                                Robbins, Mr. Victor  227.5250
581          582  Thayer, Mrs. John Borland (Marian Longstreth M...  110.8833
609          610                          Shutes, Miss. Elizabeth W  153.4625
659          660                         Newell, Mr. Arthur Webster  113.2750
660          661                      Frauenthal, Dr. Henry William  133.6500
679          680                 Cardeza, Mr. Thomas Drake Martinez  512.3292
689          690                  Madill, Miss. Georgette Alexandra  211.3375
698          699                           Thayer, Mr. John Borland  110.8833
700          701  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  227.5250
708          709                               Cleaver, Miss. Alice  151.5500
716          717                      Endres, Miss. Caroline Louise  227.5250
730          731                      Allen, Miss. Elisabeth Walton  211.3375
737          738                             Lesurer, Mr. Gustave J  512.3292
742          743              Ryerson, Miss. Susan Parker "Suzette"  262.3750
763          764          Carter, Mrs. William Ernest (Lucile Polk)  120.0000
779          780  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...  211.3375
802          803                Carter, Master. William Thornton II  120.0000
856          857         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667

In [19]:
first_class = df[df["Pclass"] == 1]
print(first_class[["PassengerId","Name","Pclass"]])

     PassengerId                                               Name  Pclass
1              2  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
3              4       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
6              7                            McCarthy, Mr. Timothy J       1
11            12                           Bonnell, Miss. Elizabeth       1
23            24                       Sloper, Mr. William Thompson       1
..           ...                                                ...     ...
871          872   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)       1
872          873                           Carlsson, Mr. Frans Olof       1
879          880      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)       1
887          888                       Graham, Miss. Margaret Edith       1
889          890                              Behr, Mr. Karl Howell       1

[216 rows x 3 columns]

In [25]:
female_under_18 = df[(df["Age"]<18) & (df["Sex"] == "female")]
print(female_under_18[["PassengerId","Sex","Age"]])

     PassengerId     Sex    Age
9             10  female  14.00
10            11  female   4.00
14            15  female  14.00
22            23  female  15.00
24            25  female   8.00
39            40  female  14.00
43            44  female   3.00
58            59  female   5.00
68            69  female  17.00
71            72  female  16.00
84            85  female  17.00
111          112  female  14.50
114          115  female  17.00
119          120  female   2.00
147          148  female   9.00
156          157  female  16.00
172          173  female   1.00
184          185  female   4.00
205          206  female   2.00
208          209  female  16.00
233          234  female   5.00
237          238  female   8.00
297          298  female   2.00
307          308  female  17.00
329          330  female  16.00
374          375  female   3.00
381          382  female   1.00
389          390  female  17.00
419          420  female  10.00
435          436  female  14.00
446          447  female  13.00
448          449  female   5.00
469          470  female   0.75
479          480  female   2.00
504          505  female  16.00
530          531  female   2.00
535          536  female   7.00
541          542  female   9.00
542          543  female  11.00
618          619  female   4.00
634          635  female   9.00
642          643  female   2.00
644          645  female   0.75
689          690  female  15.00
691          692  female   4.00
720          721  female   6.00
750          751  female   4.00
777          778  female   5.00
780          781  female  13.00
781          782  female  17.00
813          814  female   6.00
830          831  female  15.00
852          853  female   9.00
853          854  female  16.00
875          876  female  15.00

In [27]:
embarked_c_or_s = df[df["Embarked"].isin(["C","S"])]
print(embarked_c_or_s)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
884          885         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
884                             Sutehall, Mr. Henry Jr    male  25.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
884      0   SOTON/OQ 392076   7.0500   NaN        S
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C

[812 rows x 12 columns]

In [30]:
first_second_class = df[df["Pclass"].isin([1,2])]
print(first_second_class)

     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
9             10         1       2
11            12         1       1
..           ...       ...     ...
880          881         1       2
883          884         0       2
886          887         0       2
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
3        0            113803  53.1000  C123        S
6        0             17463  51.8625   E46        S
9        0            237736  30.0708   NaN        C
11       0            113783  26.5500  C103        S
..     ...               ...      ...   ...      ...
880      1            230433  26.0000   NaN        S
883      0  C.A./SOTON 34068  10.5000   NaN        S
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
889      0            111369  30.0000  C148        C

[400 rows x 12 columns]

In [39]:
#3.2 Exploratory Data Analysis Practice Excercise-1
titanic = pd.read_csv("C:/Users/Natsu Rohit/Downloads/Titanic-Dataset.csv")
median_age = titanic["Age"].median()
titanic["Age"] = titanic["Age"].fillna(median_age)

In [41]:
print(titanic.head(10))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1
7            8         0       3
8            9         1       3
9           10         1       2

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male  28.0      0
6                            McCarthy, Mr. Timothy J    male  54.0      0
7                     Palsson, Master. Gosta Leonard    male   2.0      3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S
7      1            349909  21.0750   NaN        S
8      2            347742  11.1333   NaN        S
9      0            237736  30.0708   NaN        C

In [42]:
titanic["Fare_per_Year"] = titanic["Fare"] / titanic["Age"]
print(titanic[["Fare","Age","Fare_per_Year"]].head(10))

      Fare   Age  Fare_per_Year
0   7.2500  22.0       0.329545
1  71.2833  38.0       1.875876
2   7.9250  26.0       0.304808
3  53.1000  35.0       1.517143
4   8.0500  35.0       0.230000
5   8.4583  28.0       0.302082
6  51.8625  54.0       0.960417
7  21.0750   2.0      10.537500
8  11.1333  27.0       0.412344
9  30.0708  14.0       2.147914

In [48]:
high_fare_age = titanic[titanic["Fare_per_Year"] > 5]
print(high_fare_age[["PassengerId","Fare_per_Year"]])

     PassengerId  Fare_per_Year
7              8      10.537500
16            17      14.562500
27            28      13.842105
31            32       5.232886
43            44      13.859733
..           ...            ...
813          814       5.212500
824          825      19.843750
827          828      37.004200
831          832      22.590361
850          851       7.818750

[71 rows x 2 columns]

In [54]:
high_fare_age_srt = high_fare_age.sort_values(by="Fare_per_Year",ascending = False)
result = high_fare_age_srt[["Name","Fare_per_Year"]]
print(result)

                                               Name  Fare_per_Year
305                  Allison, Master. Hudson Trevor     164.728261
297                    Allison, Miss. Helen Loraine      75.775000
386                 Goodwin, Master. Sidney Leonard      46.900000
164                    Panula, Master. Eino Viljami      39.687500
183                       Becker, Master. Richard F      39.000000
..                                              ...            ...
348          Coutts, Master. William Loch "William"       5.300000
31   Spencer, Mrs. William Augustus (Marie Eugenie)       5.232886
205                      Strom, Miss. Telma Matilda       5.231250
813              Andersson, Miss. Ebba Iris Alfrida       5.212500
480                  Goodwin, Master. Harold Victor       5.211111

[71 rows x 2 columns]

In [56]:
titanic["fare_per_class"] = titanic["Fare"] / titanic["Pclass"]
print(titanic[["PassengerId","fare_per_class"]])

     PassengerId  fare_per_class
0              1        2.416667
1              2       71.283300
2              3        2.641667
3              4       53.100000
4              5        2.683333
..           ...             ...
886          887        6.500000
887          888       30.000000
888          889        7.816667
889          890       30.000000
890          891        2.583333

[891 rows x 2 columns]

In [66]:
adult_males = titanic[(titanic["Sex"] == "male") & (titanic["Age"] >= 18)]
print(adult_males[["PassengerId","Sex","Age"]])

     PassengerId   Sex   Age
0              1  male  22.0
4              5  male  35.0
5              6  male  28.0
6              7  male  54.0
12            13  male  20.0
..           ...   ...   ...
883          884  male  28.0
884          885  male  25.0
886          887  male  27.0
889          890  male  26.0
890          891  male  32.0

[519 rows x 3 columns]

In [67]:
adult_males_srt = titanic.sort_values(by="fare_per_class",ascending = False)
print(adult_males_srt)

     PassengerId  Survived  Pclass                                Name  \
737          738         1       1              Lesurer, Mr. Gustave J
258          259         1       1                    Ward, Miss. Anna
679          680         1       1  Cardeza, Mr. Thomas Drake Martinez
88            89         1       1          Fortune, Miss. Mabel Helen
438          439         0       1                   Fortune, Mr. Mark
..           ...       ...     ...                                 ...
822          823         0       1     Reuchlin, Jonkheer. John George
271          272         1       3        Tornquist, Mr. William Henry
277          278         0       2         Parkes, Mr. Francis "Frank"
413          414         0       2      Cunningham, Mr. Alfred Fleming
302          303         0       3     Johnson, Mr. William Cahoone Jr

        Sex   Age  SibSp  Parch    Ticket      Fare        Cabin Embarked  \
737    male  35.0      0      0  PC 17755  512.3292         B101        C
258  female  35.0      0      0  PC 17755  512.3292          NaN        C
679    male  36.0      0      1  PC 17755  512.3292  B51 B53 B55        C
88   female  23.0      3      2     19950  263.0000  C23 C25 C27        S
438    male  64.0      1      4     19950  263.0000  C23 C25 C27        S
..      ...   ...    ...    ...       ...       ...          ...      ...
822    male  38.0      0      0     19972    0.0000          NaN        S
271    male  25.0      0      0      LINE    0.0000          NaN        S
277    male  28.0      0      0    239853    0.0000          NaN        S
413    male  28.0      0      0    239853    0.0000          NaN        S
302    male  19.0      0      0      LINE    0.0000          NaN        S

     Fare_per_Year  fare_per_class
737      14.637977        512.3292
258      14.637977        512.3292
679      14.231367        512.3292
88       11.434783        263.0000
438       4.109375        263.0000
..             ...             ...
822       0.000000          0.0000
271       0.000000          0.0000
277       0.000000          0.0000
413       0.000000          0.0000
302       0.000000          0.0000

[891 rows x 14 columns]

In [69]:
result = titanic[["Name","Age","fare_per_class"]]
print(result)

                                                  Name   Age  fare_per_class
0                              Braund, Mr. Owen Harris  22.0        2.416667
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0       71.283300
2                               Heikkinen, Miss. Laina  26.0        2.641667
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0       53.100000
4                             Allen, Mr. William Henry  35.0        2.683333
..                                                 ...   ...             ...
886                              Montvila, Rev. Juozas  27.0        6.500000
887                       Graham, Miss. Margaret Edith  19.0       30.000000
888           Johnston, Miss. Catherine Helen "Carrie"  28.0        7.816667
889                              Behr, Mr. Karl Howell  26.0       30.000000
890                                Dooley, Mr. Patrick  32.0        2.583333

[891 rows x 3 columns]

In [6]:
#3.3 Exploratory Data Analysis with Group-by Method Practice Excercise
import pandas as pd
titanic_df = pd.read_csv("C:/Users/Natsu Rohit/Downloads/Titanic-Dataset.csv")
total_fare = titanic_df["Fare"].sum()
print("The total fare amount is:- " ,total_fare)

The total fare amount is:-  28693.9493

In [14]:
fare_class_1 = titanic_df[titanic_df["Pclass"] == 1]["Fare"].sum()
fare_class_2 = titanic_df[titanic_df["Pclass"] == 2]["Fare"].sum()
fare_class_3 = titanic_df[titanic_df["Pclass"] == 3]["Fare"].sum()
fare_totals = [fare_class_1, fare_class_2, fare_class_3]
fare_proportions = [fare/total_fare for fare in fare_totals]
fare_percentages = [float(round(p*100, 2)) for p in fare_proportions]
print("The fare percentages are:- " ,fare_percentages)

The fare percentages are:-  [63.35, 13.25, 23.4]

In [17]:
titanic_df["Age"] = titanic_df["Age"].fillna(titanic_df["Age"].median())
def age_group(age) :
    if age < 10:
        return "child"
    elif age < 65:
        return "adult"
    else:
        return "senior"
titanic_df["age_group"] = titanic_df["Age"].apply(age_group)
total_passengers = len(titanic_df)
group_counts = titanic_df["age_group"].value_counts()
group_percentages = (group_counts / total_passengers) * 100
group_percentages.round(2)

age_group
adult     91.81
child      6.96
senior     1.23
Name: count, dtype: float64